---
kind: property
id: P:Autodesk.Revit.DB.Ellipse.RadiusX
source: html/847239c2-7567-6ccb-ba34-f8ed0dc826f7.htm
---
# Autodesk.Revit.DB.Ellipse.RadiusX Property

Returns the X vector radius of the ellipse.

## Syntax (C#)
```csharp
public double RadiusX { get; }
```